[
    [
        "779f3a59-206a-3241-adc4-d7db504f960b",
        null,
        " Описание Мы расширяем команды и ищем разработчиков для развития нескольких сервисов:   Инвестиции. Мы — лидер среди брокеров по количеству активных клиентов. Делаем инвестиции удобными, технологичными и понятными;   Бизнес. Меняем подход к ведению бухгалтерии, обмену документами между организациями и работе с архивами — переводим все и вся в цифру;   Страхование. Развиваем платформу прямых продаж. Наша цель — предсказуемый, удобный процесс для бизнеса и клиента; Платежные технологии и процессинг. Занимаемся разработкой и поддержкой платежного шлюза банка. Задачи шлюза — определять тип платежей, наполнять их данными из других систем банка и проверять разрешенность операций. У нас много интересных и разнообразных задач, опытная команда и отличные возможности для роста. Откликайтесь на вакансию, чтобы узнать о проектах и выбрать подходящий для вас. Требования Опыт разработки на Java от 3 лет Опыт коммерческой разработки на Java 11+ или Kotlin Опыт коммерческой разработки с любым из фреймворков: Spring Boot, Quarkus, Micronaut или Vert.x Опыт коммерческой разработки с одним из контейнеризаторов: Kubernetes, Docker или OpenShift Опыт коммерческой разработки с одним из брокеров: Kafka, Rabbit MQ или Active MQ Опыт коммерческой разработки с Postgress, MySQL или Oracle будет плюсом Опыт работы с системой контроля версий Мы предлагаем Работу в офисе или удаленно — по договоренности Возможность работы в аккредитованной ИТ-компании Платформу обучения и развития «  Апгрейд». Курсы, тренинги, вебинары и базы знаний. Поддержку менторов и наставников, помощь в поиске точек роста и карьерном развитии Заботу о здоровье. Оформим полис ДМС со стоматологией и страховку от несчастных случаев. Предложим льготное страхование вашим близким Бесплатный фитнес-зал или компенсацию затрат на спортивные занятия 3 дополнительных дня отпуска в год Уникальную well-being-программу, направленную на физическое и ментальное благополучие сотрудников Достойную зарплату — обсудим ее на собеседовании "
    ],
    [
        "7a4813fc-43bc-3896-a607-4c8682b01002",
        null,
        " Уровень: СА уровня Middle+/Senior от 3х лет Возраст: до 50 Локация: РФ Вилка до 350 000 net Этапы собеседований во вложении: Интервью СА этапы Общее описание: Сейчас у нас открыты позиции сразу в нескольких направлениях - Lifestyle-сервисы, банковский бэк (в том числе процессинг, АБС, эквайринг, PRM), SME, Открытие новых продуктов, Инвестиции и многое другое. Задачи СА: Подготовка спецификаций (сбор требований, анализ, документирование постановки) Проектирование интеграционного взаимодействия Помощь команде на стадии разработки и тестирования Взаимодействие с аналитиками и разработчиками смежных подразделений часто, но не всегда - работа с БД Основные требования к системным аналитикам: Актуальный релевантный опыт от 3 лет Проектирует интеграции (API и брокеры сообщений) Составляет ТЗ и занимается сбором требований как плюс (но на самом деле это тоже очень важно и без этого вряд ли позовут на техничку, особенно хороший уровень SQL!!!) Работает с SQL Был опыт проектирования баз данных Имеет опыт проектирования пользовательских интерфейсов Технологии/инструменты Микросервисная архитектура; REST/gRPC; Kafka/RabbitMQ; SQL; UML/BPMN Детали могут варьироваться от проекта Знание какого-либо языка программирования и умение разбираться в коде будет плюсом Кто точно не подходит? аналитики данных/ BI/ ETL/ DWH – всё что в сторону Big Data, упор на работу с БД, построение моделей менеджеры-эксперты-руководители-начальники - больше про управление и контроль сроков и задач бизнес-аналитики/технологи/консультанты - больше про работу с заказчиком, мало или ничего про интеграции, может быть опыт с БД кандидаты с большой разницей во времени (максимум +4ч от Мск, но важно уточнять готов ли кандидат двигать начало раб.дня) Дополнение по портрету кандидата: Кандидаты из аутсорса, аутстаффа и интеграторов должны обладать 2 годами опыта работы в продуктовых компаниях. Идеально: 2 года в продуктовой компании последним местом работы. Остальное будет рассматриваться кейсово. Компании-доноры: банки, финтех, страховые (наши конкуренты) крупные системные интеграторы (EPAM, Luxoft, Accenture, Bell, Jett, AT Consulting и т.д.) высокотехнологичные компании ( , Avito,   и т.д.) с осторожностью - нефтегаз, ретейл ( ), зависит от задач НЕ СМОТРИМ - НИИ, ВУЗы (некоммерческие проекты или pet-проекты), «оборонка», «госуха» (работа по ГОСТам, приемка и тд - мало общего с задачами наших СА) Где ещё почитать про СА:   внимание, тайминги секций указаны устаревшие (1час), обе секции сейчас 1,5 часа идут   это лендинг, где есть информация о стеке, технологиях, требованиях к соискателю и возможностях роста. Нужно сохранить в отдельный файл, ссылку кандидатам не давать. "
    ],
    [
        "c03085c3-9b1e-3564-bb1e-59aa72e5fbca",
        null,
        " Желательно знания Oracle   сегодня — не просто банк. Это сервисы, которыми пользуются люди с разными потребностями, интересами и желаниями. И для каждого нашего клиента мы стараемся сделать удобные и качественные ИТ-продукты. Без сильной, экспертной ИТ-команды это было бы невозможно, поэтому у нас всегда есть интересные проекты для проверки твоих скиллов, собственная IT-академия для начинающих и классный мерч, который можно получить за хорошую работу. Сейчас у нас открыта вакансия Ведущий аналитик DWH в департамент аналитики. Чем предстоит заниматься: – Участие в обсуждении инициатив бизнес-пользователей с точки зрения их возможной реализации в информационных системах; – Интервьюирование пользователей, сбор бизнес-требований; – Исследование информационных систем Банка и интервьюирование технических владельцев для определения источников данных, их свойств и логики наполнения; – Написание технических заданий и функциональных требований на доработку отчетов, БД и интеграционных решений в соответствии с существующим архитектурным ландшафтом Банка; – Согласование проектной документации; – Контроль соответствия разрабатываемого продукта подготовленной документации (функциональное тестирование); – Участие в пользовательском тестировании в качестве посредника между бизнесом и разработчиками; – Анализ SQL-кода существующих процедур и пакетов с целью проектирования доработок; – Анализ ошибок и формирование требований на доработку функционала в рамках 3-ей линии техподдержки. Что для нас важно: – Опыт работы работы с хранилищем данных (Oracle); – Глубокое знание SQL (диалект Oracle), написание сложных запросов, чтение PL/SQL-кода; – Опыт проектирования и разработки отчетности на базе одного из инструментов: MS SQL Reporting Services, Tableau, QlikView; – Опыт проектирования объектов БД, понимание архитектуры хранилищ данных; – Желателен опыт работы с ETL-средствами, предпочтительно с Informatica PowerCenter; – Плюсом будет опыт работы в финансовых организациях или на проектах в финансовых организациях в роли аналитика данных или системного аналитика (понимание банковской предметной области, в частности, бухгалтерского учета); – Плюсом будет знакомство с СУБД Vertica; – Навыки описания потоков загрузки данных в хранилища (DWH), составления технической документации (Source2Target, модель данных и т.д.). Что мы предлагаем: – График работы удаленный, но всегда можно приехать в офис; – Корпоративная электронная библиотека; – Страхование при выезде за рубеж; – Корпоративная социальная и материальная поддержка в определенных жизненных ситуациях; – 10 рабочих дней 100% оплачиваемого листа нетрудоспособности в год; – Корпоративные скидки и специальные акции от компаний- партнеров; – Льготные условия на продукты Банка; – Корпоративные мероприятия для сотрудников и их детей; "
    ],
    [
        "a8dd83c3-178d-3c70-90c2-7c3648f6b96a",
        null,
        " Знания и опыт • Умение управлять ожиданиями заказчика, коммуникабельность, ответственность в принятии решений • Опыт работы аналитиком – от 2 лет • Опыт работы в сфере разработки ПО брокерской отрасли (желательно) – от 2 лет • Опыт работы (желательно): o инвестиционные банки, брокерские компании o управляющие компании o организаторы торгов на фондовом рынке (биржи и т.д.), • Высшее техническое или экономическое образование (желательно), • Знание продуктов и процессов брокерского бизнеса (желательно), Существенное преимущество • Участие в интеграционных проектах, опыт работы с MQ-очередями, веб-сервисами, Kafka. Описание сквозных бизнес-процессов и потоков данных. • Опыт во внедрении, развитии и поддержке индустриальных ИТ-решений автоматизации брокерского или инвестиционного бизнеса • Знание нефункциональных требований высоконагруженных банковских систем • Знание теории системного и бизнес анализа применительно к разработке ПО. Знание основных нотаций моделирования –UML, BPMN. • Принимал участие в разработке микросервисов. Не общее понимание, а прям описывал их, писал требования и пр. • Участие в проекте с Java и PostgreSQL. Технические знания и навыки o SQL o Jira, Confluence o XML, JSON o (Желательно) опыт работы c микро-сервисами, Kubernetes, OpenShift, PostgreSQL Условия: • Возможность участвовать в крупных проектах; • Конкурентную и полностью официальную заработную плату; • Комфортный и современный офис, возможен гибридный график; • Пакет льгот для сотрудников от наших партнеров: ДМС + стоматология + программа для родственников, льготное кредитование и страхование, партнерские скидки; • Для комфортной работы предоставляем необходимое оборудование. "
    ],
    [
        "9d98eba0-13bb-38d3-b742-4fd445954b3d",
        null,
        " - Продактов в компании сейчас порядка 250, все вертикали, как и сам   активно растут и занимают лидирующие позиции по рынку (Например, Недвижимость в январе 2023г. обогнала конкурентов и стала лидером на рынке). Как можно допродать: - Большое количество лучших специалистов, в т.ч. с международной экспертизей - В июле   занял 2 место в рейтинге самых привлекательных работодателей среди продактов ( - Огромная структура, на базе которой постоянно запускаются новые продукты (есть возможность как развивать уже готовое, так и создавать с “0”) - Крутая практика менторства, очень активно растут продакты, полугодовые перфоманс ревью Откуда смотрим: - глобально, компании с крутыми и популярными многопользовательскими продуктами, лидеры рынка (особенно ecom), можно с бэкграундом в стартапах, но чтоб не только они - Другие маркетплейсы (Озон,  мегамаркет, Ламода, Алиэкспресс и проч.) / классифайды (Циан, HH, Aviasales, Работа.Ру, Суперджоб и проч.) - Из Банков - хорошо заходят Тинёк и  , можно с бэкграундом оттуда (остальные банки лучше не нужно - только если человек ну супер-движовый и есть крутые результаты, а в банк его как-то занесло - например, в СБЕР и Точка) - Компании с крутой продуктовой культурой (Skyeng, Epam, ex. VK/Mail.ru, ex.  ) - Крупный телеком case by case, но важно, чтоб кандидаты были скилловые * под специфичные позиции можно смотреть, например, компании, где крутой биллинг или же идти по Аналогии с вертикалями   (нужен человек в Авто, смотрим по рынку компании с Авто и т.д.) Точно нет : Всё, что с негибкой структурой и отсутствием нацеленности на результат (госуха, банки и проч). Что важно: - для Lead/Head и выше важен +- хороший английский, т.к. есть топы-иностранцы, которые говорят плохо по-русски и есть документация на английском (формата 6 page) Этапы интервью (стандартный флоу в   для Middle/Senior, где мы сначала идём без конкретной вакансии, ввиду специфичности опыта или Head/Cluster Lead, можно сразу идти под конкретную вакансию): HR-блок 1) Скрининг с Sense (узнаём о команде, подчинении, с какими метриками работал, делал ли сам аналитику, проводил ли А/Б тесты, результаты по продуктам, в целом) Направляем в чат резюме + сопровод или файл скрининга ( ) !!! Деньги указываем только в сопроводе, из резюме и скрининга убираем 2) HR-скоринг  на час, в т.ч. проверяет харды !!!Технический блок - раньше было 4 секции, о которых продакты наслышаны (харды, кейс, аналитика и UX), сейчас процесс оптимизировали: 1) скоринг по оптимизации продукта на 30 мин с продактам грейда Senior+ 2) 1,5ч кейс с Продактом Sen+ и Аналитиком Sen+ в формате ролевой игры) 3) HR-скоринг на Culture Fit - проверка на то, как взаимодействует с командой (даже если продакт круто прошёл техничку, ему могут отказать по калча фиту - поэтому нужны люди структурные, с классными софтами, проактивные и готовые драйвить, с “горящими глазами”) - 1-1,5 ч. И наконец - знакомство с командами (обычно 2-3 команды, чтобы было из чего выбрать) Вилки примерные: * звёздам готовы согласовывать больше - Middle - 350/руки max - Senior - до 500 гросс/ либо совокуп - Lead - 560-630 гросс max + LTI - Бонусы у продактов полугодовые как и перформанс ревью (есть возможность растить з/п, если заперформить) Формат работы + оформление: Офисы: Москва/казань/питер/самара Готовы гибрид/полную удалёнку (в том числе из любой страны, если человек приехал и оформился в офис  , может уезжать обратно) есть армянское юр лицо туда сейчас офорляют от грейда Senior+ и если критичная ситуация (например, потеря резидентства) Если локация спорная, уточняем, есть ли критичные аспекты по трудоустройству С СНГ ребят устраивают, если есть разрешение на работу в РФ  описание "
    ],
    [
        "4e2299c0-13fc-301d-8f3c-3ccfd0281ce6",
        null,
        "2 проекта: 1. Перевод системы САП на свою внутреннюю систему. Там более менее немного успели сделать верхнеуровневую архитектуру. Есть отдельная команда девопсов, сеньеры менторят младших коллег 2. Проект для автоматизации планирования, не сделано ничего. « » — это центр информационных и коммуникационных технологий крупнейшего горнодобывающего и сталелитейного холдинга. Кроме того, мы являемся аккредитованной Минцифры IT-компанией, что позволяет нашим сотрудникам пользоваться дополнительными льготами. « » сегодня это: 32 года опыта IT экспертизы; 20 городов присутствия по России; более 2200 сотрудников; более 200 предоставляемых сервисов. Станьте частью « » — команды, которая непрерывно создает и внедряет IT-решения для крупнейшего горнодобывающего и сталелитейного холдинга! Сегодня мы разрабатываем проекты на Python, Java, Scala и JavaScript, создаем микросервисы в Docker-контейнерах под управлением Kubernetes, а для работы с Big Data используем Hadoop, Apache Kafka и Apache Spark. Наши digital-специалисты работают в командах с сотрудниками производства, чтобы видеть бизнес в формате 360°. Дальше — больше! Вы будете заниматься: участвовать в создании крупного российского решения для металлургии(MES импортозамещение), которое обеспечит потребности бизнеса в управлении производством, в роли back-end разработчика; поддерживать и сопровождать разработанный функционал. Мы ожидаем, что Вы: имеете опыт работы Java-разработчиком от 1 года; имеете техническое образование в сфере IT; владеете знаниями Java 8 и SQL; занимались разработкой в IntelliJ IDEA; имеете опыт работы с JSON и с инструментами сборки Maven, Gradle, а также опыт работы с системой контроля версий Git. Будет плюсом: знание PL SQL (Oracle); опыт JasperReport; опыт в разработке REST или SOAP-сервисов; опыт работы с Kafka, LiquidBase, Redis; знание Spring MVC, Spring Data, Spring Boot; опыт работы в микросервисной архитектуре; опыт работы с Jenkins, GrayLog, Kubernetes. Мы предлагаем: трудоустройство в аккредитованной IT-компании и возможность пользоваться соответствующими льготами: 1. льготная ипотека; 2. отсрочка от призыва на военную службу. гарантии стабильности: оформление по ТК РФ, достойную заработную плату и годовые премии по итогам года. медицинскую помощь сотрудников: ДМС (включая стоматологию), доплату по больничному листу (с 1 по 10 день – 100% до оклада, с 11 по 20 день – 50%). опции для родителей: материальную помощь за рождение ребёнка, доплату до 100% за отпуск по беременности и родам. корпоративную мобильную связь. Мы создали привлекательную среду, в которой сотрудники быстрее достигают результатов. Присоединяйтесь! "
    ],
    [
        "a8f56ed3-3ef3-365d-ade4-2df4db5d4af8",
        null,
        " Стрим занимается системой управления залогами, сейчас в нём три уже существующие команды и создаётся шесть новых. Наша команда (формальное название \"Миграция залогов\")- новая, будет заниматься, скорее всего, миграцией залогов из смежных АС, но это пока не точно. !!!!!!!!!!!Важная информация: На проектах   нельзя работать из-за границы, поэтому необходимо уточнять у кандидатов, где они находятся и готовы ли работать с территории РФ (кроме Крыма). Формат работы: для МСК – комбинированный дистанционный, для регионов – дистанционный. Кандидат должен иметь военный билет или приписное (до исполнения 27 лет). Если у кандидата открыто ИП или есть ООО (и пр. формы собственности) с видами деятельности «около IT», то он должен быть готов инициировать закрытие до момента трудоустройства.   — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. Вместе мы создаем финтех, который будет доступен каждому: развиваем «Цифровую банковскую платформу», выстраиваем партнерские отношения с топовыми финансовыми компаниями, создаем комплексные решения для фронт- и бэк-офисов, строим системы работы с большими данными. В   стабильность работы — финансовая надежность, социальные гарантии, бонусы и бенефиты, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. Мы стремительно растем, масштабируемся и ищем новых специалистов в команду! Вместе с нами тебе предстоит участвовать в проекте по формированию современного IT-ландшафта в банке (Java Spring boot, PostgreSQL, React JS), созданию и поддержке АБС, решать сложные задачи межсистемного взаимодействия. Вместе с нами тебе предстоит: Анализ бизнес-требований, валидация процессов. Проектирование модели данных предметной области Участие в проектировании микросервисной архитектуры системы Оптимизация существующих структур для хранения бизнес-данных Проектирование межсервисного и межсистемного взаимодействия Описание системных требований для backend и frontend, описание методов Подготовка сервисной документации Участие в тестировании, приемке функционала Работа в agile-команде, взаимодействие со смежными командами. Какие знания и навыки для нас важны: Опыт проектирования/участия в проектировании функционала ИС, в том числе, проектирование структуры данных, API, опыт валидации пользовательских сценариев Опыт работы с РСУБД - глубокое понимание, написание SQL-запросов средней сложности Опыт проектирования межсистемных взаимодействий Опыт проектирования микросервисов Опыт проектирования новых пользовательских сценариев Моделирование предметных областей Проработка UseCase-диаграмм и сценариев взаимодействия сервисов при реализации бизнес-функциональности (sequence-диаграммы) Формирование вариантов возможной технической реализации решения Разработка и согласование функциональных и технических спецификаций Согласование промежуточных и итоговых результатов с Заказчиком Коммуникации с разработчиками для эффективной реализации задач Опыт работы IT-аналитиком не менее 3х лет (бизнес/системный анализ) Уверенное знание методологий и принципов разработки ПО (в т.ч. гибкие методологии) А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей эксклюзивный зарплатный проект для сотрудников в банке ВТБ Вместе с нами ты сможешь решать интересные задачи, профессионально расти и развиваться, а также участвовать в кросс-командных проектах и определять собственную траекторию развития. "
    ],
    [
        "cdbe4d64-991a-35a1-8b71-a05a5ce24123",
        null,
        " Допустимые грейды: до 16 Уровень - сениор От 3 лет релевантного опыта В теле письма прописывать задачи, которые кандидат выполнял на последних проектах !!!!!!!!!!!Важная информация: На проектах   нельзя работать из-за границы, поэтому необходимо уточнять у кандидатов, где они находятся и готовы ли работать с территории РФ (кроме Крыма). Формат работы: для МСК – комбинированный дистанционный, для регионов – дистанционный. Кандидат должен иметь военный билет или приписное (до исполнения 27 лет). Если у кандидата открыто ИП или есть ООО (и пр. формы собственности) с видами деятельности «около IT», то он должен быть готов инициировать закрытие до момента трудоустройства.   — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. Вместе мы создаем финтех, который будет доступен каждому: развиваем «Цифровую банковскую платформу», выстраиваем партнерские отношения с топовыми финансовыми компаниями, создаем комплексные решения для фронт- и бэк-офисов, строим системы работы с большими данными. В   стабильность работы — финансовая надежность, социальные гарантии, бонусы и бенефиты, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. Мы стремительно растем, масштабируемся и ищем новых специалистов в команду! Вместе с нами ты будешь заниматься: Разработкой и внедрением высоконагруженных микросервисов для потоковой обработки данных; Рассчитывать агрегаты, применять мат. модели, реализовывать триггерную логику; Разрабатывать и развивать стриминговую платформу; Участвовать во внедрении доработок; Участвовать в проектировании решений в соответствии с существующим архитектурным ландшафтом банка. Какие знания и навыки для нас важны: Опыт Java от 3 лет (Spring, Redis); Опыт работы с Kafka; Опыт разработки высоконагруженных сервисов; Опыт разработки многопоточных приложений; Готовность работать на территории РФ. Приветствуется: Опыт работы со Spark Streaming, Apache Flink, Redis/Tarantool, OpenShift/Kubernetes; Опыт работы с микросервисной архитектурой; Лидерские качества, способность обучаться и обучать других членов команды А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей Вместе с нами ты сможешь решать интересные задачи, профессионально расти и развиваться, а также участвовать в кросс-командных проектах и определять собственную траекторию развития. "
    ],
    [
        "7eca3dc1-2108-3152-85be-cd0ee7aa1493",
        null,
        " Описание профиля (требования) Требуемый опыт работы: 2-4 года опыта в DevOps, 1–2 года в банковской сфере Полная занятость, полный день. Мы ищем DevOps инженера с опытом администрирования enterprise инфраструктуры в технологическую команду развития Business critical систем банка. В задачи кандидата входит развитие DevOps окружения проекта с использование современных технологий и практик. Приветствуется наличие опыта самостоятельного проектирования и развертывания CI / CD пайпов для Java-приложений. Личные качества: хорошие коммуникативные навыки, внимательность к деталям, аккуратность, работа на результат. Технические компетенции: опыт реализации решений на JVM стеке в существующем IT-ландшафте; TeamCity / Jenkins, Helm / Ansible, Kubernetes / OpenShift + ServiceMesh / Istio, Docker + Docker Compose + Dockerfile, Nexus, Maven, BitBucket, Jira, Bash / Python / Kotlin / Groovy, Git, Terraform, Wildfly / Tomcat, SQL + PostgreSQL, S3, Prometheus, Grafana, ELK (logstash, fluentb, Kibana), REST API, OSI. Основные задачи, которые предстоит решать сотруднику) - развитие DevOps окружения проекта, включая: - администрирование тестовых сред (работа с сертификатами, mTLS, конфигурирование серверов в кластерах Kubernetes, S3); - адаптация и развитие CI / CD pipeline-а на TeamCity и Jenkins с учетом реалий разработки; - проектирование инфраструктуры проекта с упором на надежность, отказоустойчивость, с учетом требований ИБ; - аллокация облачных ресурсов; - разработка Helm chart-ов, Ansible playbook-ов, настройка sidecar-ов; - настройка ELK; "
    ],
    [
        "01713376-e04d-3f9d-9287-7a5ff74918c3",
        null,
        " Системный аналитик (14 грейд middle, 15 грейд senior), 16 грейд могут согласовать звезде, но редко. Уровень миддл+/синьор Коллеги, будет удобнее, если вы всегда будете прикладывать результаты мини опросника по кандидатам. Это для нас много полезнее, чем описание опыта работы и тп. Ниже прикладываю сам опросник (да/нет): 1. Опыт проектирования реляционных БД 2. Опыт проектирования REST API 3. Опыт работы с брокерами сообщений (уточнить с какими работал?) 4. Опыт работы в микросервисной архитектуре 5. Использование UML в работе   — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. Вместе мы создаем финтех, который будет доступен каждому: развиваем «Цифровую банковскую платформу», выстраиваем партнерские отношения с топовыми финансовыми компаниями, создаем комплексные решения для фронт- и бэк-офисов, строим системы работы с большими данными. В   стабильность работы — финансовая надежность, социальные гарантии, бонусы и бенефиты, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. Мы стремительно растем, масштабируемся и ищем новых специалистов в команду! Системный аналитик Стрим - Пакеты и программа лояльности СМБ Вам предстоит: Работа по развитию системы тарификации на новой омниканальной платформе Банка в микросервисной архитектуре; участие в полном цикле разработки программных продуктов; сбор, анализ, формализация требований(в том числе оценка НФТ, выбор способа интеграции, описание интеграционных потоков и тд.); постановка задач разработчикам; участие в оценке трудоёмкости работ; подготовка технической и сопроводительной документации (функциональные и нефункциональные требования, руководства администратора и пользователя); приемочное тестирование. Для нас важны: Хорошо развитые коммуникационные навыки, умение находить общий язык с бизнес-заказчиками, с разработчиками, а также с коллегами из смежных команд; умение анализировать бизнес-процессы, четко и структурированно формулировать требования по их автоматизации; умение работать по нечётким требованиям; готовность принимать решения и брать на себя ответственность. Будет плюсом: Знание процессов обслуживания клиентов ЮЛ в банке; опыт работы с системами тарификации; опыт работы с нереляционными базами данных; понимание требований информационной безопасности. Мы ждём от Вас: Опыт использования UML диаграмм при описании требований; опыт решения интеграционных задач (REST, брокеры сообщений, MQ); знание принципов построения микросервисной архитектуры; знание SQL и опыт проектирования реляционных баз данных; понимание форматов XML/XSD, JSON; опыт самостоятельного проектирования REST API. А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей Вместе с нами ты сможешь решать интересные задачи, профессионально расти и развиваться, а также участвовать в кросс-командных проектах и определять собственную траекторию развития. "
    ],
    [
        "54ec7d23-cf72-30c0-b0b5-22509ddbdfef",
        null,
        " 14, 15, 16 грейд, Только синьеры   — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. Вместе мы создаем финтех, который будет доступен каждому: развиваем «Цифровую банковскую платформу», выстраиваем партнерские отношения с топовыми финансовыми компаниями, создаем комплексные решения для фронт- и бэк-офисов, строим системы работы с большими данными. В   стабильность работы — финансовая надежность, социальные гарантии, бонусы и бенефиты, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. Мы стремительно растем, масштабируемся и ищем новых специалистов в команду! Новое описание!!!! Вместе с нами Вам предстоит: Проектирование и реализация ETL-потоков, сборка, тестирование, отладка витрин; Оптимизация работы БД; Разработка документации и спецификаций к витринам данных в Confluence; Подготовка тест-кейсов и проведение регрессионного тестирования Мы ждем от Вас: Знания принципов построения систем хранения и обработки данных; Опыт работы с аналитическими хранилищами, знание БД, хорошее знание SQL; Наличие опыта работы с экосистемой Hadoop (Hive, Spark, Parquet) - ОБЯЗАТЕЛЬНО; Опыт работы с реляционными СУБД (Oracle, PostgreSQL); Опыт промышленной разработки ETL Apache AirFlow; Понимание методологий Agile и DevOps; Опыт работы в Банке на решение задач подразделений рисков, казначейства, финансового департамента, управленческой и регуляторной отчетности будет плюсом; А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей эксклюзивный зарплатный проект для сотрудников в банке ВТБ Вместе с нами ты будешь: Выполнять функциональные обязанности в рамках проекта по Миграции Платформ Данных (Arenadata Greenplum DB); Осуществлять разработку и проверку работоспособности ETL процессов по загрузке данных из систем-источников в детальный слой БД. (разработка DAG-ов в Airflow, процедур в Greenplum); Выполнять оптимизация существующего кода ETL-процессов; Помощь при организации тестирования ETL. Какие знания и навыки для нас важны: Опыт работы в роли разработчика DWH не менее 3 лет; Уверенные знания SQL; Опыта работы с промышленными ETL инструментами(SAS DI, Informatica PC, ODI); Опыт работы с Oracle, Greenplum, PostgreSQL. Как преимущество : Понимание модели данных DataVault; Базовые знания командной строки Unix; Навыки работы с системами контроля версий кода на основе Git. А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей Вместе с нами ты сможешь решать интересные задачи, профессионально расти и развиваться, а также участвовать в кросс-командных проектах и определять собственную траекторию развития. "
    ],
    [
        "dfaf7cc8-3726-361e-b7cf-6d9746d6bf77",
        null,
        " Грейд до 13 МСК/СПБ - 283000 Регионы - 233500, премия 12% Описание проекта: Автоматизация своевременного выявления ФКР с использованием технологий BigData. Оптимизация перечня ФКР на основе статистического анализа предсказательной силы (по типам клиентов). Оптимизация процедуры принятия решений в зависимости от существенности ФКР, снижение времени реакции на «тяжелые» ФКР (по типам клиентов). Развитие Мониторинга как “зарабатывающей” функции (режим “вечно зеленых” лимитов). Автоматизация календарного мониторинга выполнения условий контрагентами. Требования для QA: Понимание теории тестирования (кандидат как минимум должен знать разницу между регулярно указываемыми в резюме регрессионным, smoke и sanity тестированием) - Опыт функционального, интеграционного и регрессионного тестирования веб-приложений - Опыт написания тестовой документации (чек-листы, тест-кейсы, тестовые планы и сценарии, отчёты о тестировании) - Уверенные знания SQL для написания запросов к БД (Oracle) - Опыт работы с баг-трекинговыми системами - Обеспечение 3-й линии поддержки при разборе инцидентов пром.окружения (кандидат должен быть готов к общению с пользователями) Будет плюсом: - Высшее техническое (в сфере IT) образование - Базовые знания HTML - Знание жизненного цикла ПО и методологии разработки - Умение Google’ить "
    ],
    [
        "61a5a940-c9f2-3f9f-bbda-9cf735697878",
        null,
        " Описание стрима: Состоятельные клиенты. Более 10 команд в стриме Разработка для работы с сегментом Private banking (Клиенты с активами от 50 млн руб.) и Привилегия (Клиенты с активами от 3 млн руб. или с зарплатой от 200 тыс. руб.) Основные задачи: Привлечение каждого потенциального клиента Доступ к премиальным банковским продуктам и сервисам Совершение всех операций не выходя из дома Индивидуальный подход на всех этапах взаимодействия с клиентом Стрим, как ИТ-партнер для бизнеса занимается омниканальным обслуживанием клиентов. Для предоставления возможности клиенту самостоятельно выбирать формат (онлайн/офлайн) и канал взаимодействия с банком (самостоятельно, звонок из банка, видео-звонок, чат). Идеальные требования: Опыт работы в роли Лидера команды по разработке от 2 лет; Опыт управления кроссфункциональной командой разработки; В прошлом опыт работы в роли Разработчика или Системного аналитика; Знание принципов гибких методологий разработки (scrum, kanban); Хорошие коммуникативные навыки и умение управлять ожиданиями заказчика; Опыт участия в продуктовой проработке требований; Чувство прекрасного для разработки лучших продуктов, которыми будут пользоваться тысячи пользователей; Проактивность, нацеленность на результат, самостоятельность в принятии решений; Высшее техническое образование. Упрощенные требования: Опыт работы в роли Руководителя проектов по разработке от 3 лет; Знание принципов гибких методологий разработки (scrum, kanban); Хорошие коммуникативные навыки и умение управлять ожиданиями заказчика; Опыт участия в продуктовой проработке требований; Чувство прекрасного для разработки лучших продуктов, которыми будут пользоваться тысячи пользователей; Проактивность, нацеленность на результат, самостоятельность в принятии решений; Высшее техническое образование. Важно! В прошлом опыте не работал продавцом/аккаунтом. Обязанности: Сопровождать задачи от момента получения до релиза; Решать архитекторуные вопросы совместо с Архитектором стрима; Проводить церемонии команды: планирование, оценка, ретроспектива, демо; Участвовать в декомпозиции задач для взятия в спринты; Строить продуктовое и ресурсные планы, участвовать в управлении релизами; Выстраивать взаимодействия с коллегами, отвечающими за бизнес и продуктовое видение; Организовывать работы Scrum – команды (около 12 человек) полного цикла, включая: разработчиков, аналитиков, тестировщиков. "
    ],
    [
        "4c9676a3-15f9-3ec7-88ac-96dab7b343ba",
        null,
        " Грейды – 14, 15 (2, 3, 4), 16 региональный можно пробовать   — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. Вместе мы создаем финтех, который будет доступен каждому: развиваем «Цифровую банковскую платформу», выстраиваем партнерские отношения с топовыми финансовыми компаниями, создаем комплексные решения для фронт- и бэк-офисов, строим системы работы с большими данными. В   стабильность работы — финансовая надежность, социальные гарантии, бонусы и бенефиты, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. Мы стремительно растем, масштабируемся и ищем новых специалистов в команду! Вместе с нами Вам предстоит: – Сбор, анализ и разработка функциональных и нефункциональных требований – Разработка и поддержка документации, связанной с ИС, с соблюдением стандартов Банка. – Участие в направлениях деятельности команды: сопровождение миграций ИС на новые версии СПО, оборудования; Capacity Management ИС; – Консультация потребителей услуг ИС. – Участие в процессах внедрения ИС. – Подготовка и проведение тестирования ИС и ее компонент. – Работа в Agile-формате, работа с backlog, совместно с лидером команды постановка задач в backlog смежных команд, аргументация необходимости реализации/отмены задач. – Участие в agile церемониях команды и стрима. – Анализ инцидентов в рамках 3ей линии поддержки Мы ждем от Вас: – Опыт системного анализа в решениях Big Data, интеграциях, Data WareHouse, понимание принципов работы экосистемы Hadoop и ее компонентов (hive, hdfs, spark) а также принципах проектирования решений на их основе. – Опыт написания документации. – Опыт работы с реляционными СУБД и написание запросов в таких системах. – Опыт работы с инструментами ETL и средствами управления потоками данных. – Коммуникативные навыки, умение находить общий язык как с бизнес-заказчиками, так и с разработчиками и смежными подразделениями. – Понимание жизненного цикла ИТ-решений и ИС. – Умение полно и ясно излагать свои мысли. – Понимание подхода к организации тестирования ИС – Готовность работать на территории РФ. Будет плюсом: – Понимание основных банковских продуктов и процессов. – Опыт работы с дистрибутивами Hadoop от Cloudera, Arenadata. – Опыт работы с реляционными СУБД для больших данных (Teradata, Exadata, Vertica, Grenplum и т.п.) – Понимание подходов к защите информации. – Опыт работы с Kafka А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей эксклюзивный зарплатный проект для сотрудников в банке Вместе с нами ты сможешь решать интересные задачи, профессионально расти и развиваться, а также участвовать в кросс-командных проектах и определять собственную траекторию развития. "
    ],
    [
        "ab135980-4634-3579-8707-2f094b5579a9",
        null,
        "   сегодня — не просто банк. Это сервисы, которыми пользуются люди с разными потребностями, интересами и желаниями. И для каждого нашего клиента мы стараемся сделать удобные и качественные ИТ-продукты. Без сильной, экспертной ИТ-команды это было бы невозможно, поэтому у нас всегда есть интересные проекты для проверки твоих скиллов, собственная IT-академия для начинающих и классный мерч, который можно получить за хорошую работу. В рамках выстраивания архитектуры и процессов CI/CD, в нашем банке открыта вакансия DevOps инженер. Чем предстоит заниматься: Участие в разработке архитектурных решений; Конфигурирование и поддержка высоконагруженных систем в различных окружениях; Развитие проектов на микросервисной архитектуре и перевод легаси в IAC; Оптимизация и развитие CI/CD; Поддержка и взаимодействие с командами L2/разработки/тестирования/IT/Безопасности; Траблшутинг нештатных ситуаций и анализ причин их возникновения. Что для нас важно: Отличные практические знания Linux(любая из ОС: RHEL, CentOS, Ubuntu); Контейнеризации, минимум 2х любых оркестраторов; Отличное знание Ansible и опыт написания сложных ролей (на подобии kubespray и т.д.). Знакомство с Terraform или Packer; Отличное знание bash/sh; Опыт развертывания и конфигурирования kubernetes в in-house; Настройка Ingress controller в inhouse и/или облачных kubernetes-инсталляциях; Опыт построения отказоустойчивых решений с балансировкой нагрузки (HAProxy, NGinx, heartbeat/vrrp); Опыт разработки микросервисной архитектуры; Понимание процессов CI/CD, большой практический опыт с Gitlab и/или TeamCity. Было бы плюсом: Опыт создания helm-чартов, kube-operators; Умение работать с различными автотестами. Уверенное знание видов тестирования (Smoke, Sanity, Integration, Performance) с их интеграцией в CI; Коммиты и пул реквесты в большие опенсорсные проекты будут значительным плюсом; Что мы предлагаем: График работы гибрид (Москва) или удаленный ДМС со стоматологией и госпитализацией; Корпоративные скидки от партнеров; Бесплатное обучение в IT-академии для начинающих специалистов; 10 рабочих дней 100% оплачиваемого больничного в год; Доступ к электронной библиотеке; Льготные условия на продукты банка; Корпоративные мероприятия для сотрудников и детей; Участие в спортивных соревнованиях (киберспорт, мини-футбол, хоккей и др.) Участие в благотворительных и социально значимых активностях. "
    ],
    [
        "042d69ba-f5fb-3248-aa7d-ae47d5ff21ea",
        null,
        " Супер горящая вакансия с очень большой потребностью (порядка 15 штук). Сюда направляем аналитиков от 13 до 15 грейда. Можно аналитиков / начинающих архитекторов. Важно! Надо обязательно уточнять у кандидатов, занимались ли они моделированием детального слоя данных по методологиям 3NF (3-я нормальная форма) и Data Vault. Моделировали ли они данные по методологии «Звезда», «Снежинка». И необходимо их предупредить, что на интервью будет уделено особое внимание опыту и навыкам моделирования. Также обязательно надо предупредить, что будем проверять их SQL, в т.ч. понимание использования подзапросов и оконных функций.   — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. Вместе мы создаем финтех, который будет доступен каждому: развиваем «Цифровую банковскую платформу», выстраиваем партнерские отношения с топовыми финансовыми компаниями, создаем комплексные решения для фронт- и бэк-офисов, строим системы работы с большими данными. В   стабильность работы — финансовая надежность, социальные гарантии, бонусы и бенефиты, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. Мы стремительно растем, масштабируемся и ищем новых специалистов в команду! Обязанности: Сбор и уточнение требований, анализ систем-источников, профилирование данных источников. GAP-анализ в рамках проектов миграции на новые DWH платформы. Разработка логической и физ. модели данных с использованием типовых подходов к моделированию: 3NF, star-схема, Data Vault и пр. Проработка логики загрузки, разработка Source-to-target, описание маппингов. SQL прототипирование процессов загрузки.  ирование и сверка результатов расчетов по спроектированному функционалу. Разработка и согласование проектной документации: бизнес-требования, детальные ТЗ и т.п. Коммуникации с бизнес-подразделениями. Требования: Опыт работы с DWH от 3-х лет в роли аналитика, системного аналитика. Желателен опыт крупных проектов в части построения/развития Хранилищ данных. Понимание архитектуры DWH, типичных слоёв Хранилища. Желателен опыт работы с Greenplam/Arenadata, знание MPP систем. Практический опыт моделирования данных (data design), как логическое, так и физическое моделирование данных. Желателен опыт работы с case-средствами моделирования PowerDesigner, ERWin. Знание и опыт проектирования в модели данных Data Vault является преимуществом. Уверенное владение SQL. Опыт разработки Source-to-target (описание маппингов) для ETL. Опыт BI-проектов является преимуществом (разработка витрин под BI, разработка визуализаций). Опыт разработки тех. документации. Сильные аналитические скиллы и коммуникационные навыки. Крайне желателен опыт проектов в банковской или финансовой сфере. ​​​​​ А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей эксклюзивный зарплатный проект для сотрудников в банке Вместе с нами ты сможешь решать интересные задачи, профессионально расти и развиваться, а также участвовать в кросс-командных проектах и определять собственную траекторию развития. "
    ],
    [
        "b1148bfd-c881-3e51-92fd-29912e58b38d",
        null,
        " Проекты разные   — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. Вместе мы создаем финтех, который будет доступен каждому: развиваем «Цифровую банковскую платформу», выстраиваем партнерские отношения с топовыми финансовыми компаниями, создаем комплексные решения для фронт- и бэк-офисов, строим системы работы с большими данными. В   стабильность работы — финансовая надежность, социальные гарантии, бонусы и бенефиты, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. Мы стремительно растем, масштабируемся и ищем новых специалистов в команду! Задачи: Выполнять функциональные обязанности в рамках проектов по созданию интеграционных решений для аналитических систем и хранилищ данных; Осуществлять разработку сервисов интеграции и управления ETL-процессами с использованием Apache Spark, Airflow и Kafka, СУБД Impala и Clickhouse; Осуществлять разработку и проверку работоспособности процессов по загрузке данных из систем-источников в слои хранилища с использованием SQL, других языков (pl/pgSQL и т.п.) и специализированных средств разработки (разработка DAG-ов в Airflow, скриптов Spark и запросов Impala и других СУБД, работа с ETL фреймворками и потоковыми данными из Kafka); Выполнять оптимизацию существующего кода ETL-процессов; Участвовать в сборке поставки и сопровождении установки на продуктивный контур; Активно участвовать в организации процессов тестирования, автоматизации разработки, документировании кода; Активно участвовать в распространении знаний и хороших практик. Требования: Опыт разработки на Python; Опыт проектирования и разработки ETL-процессов; Опыт работы с интерфейсами взаимодействия: REST API, SOAP; Знание основных алгоритмов, структур данных и основных паттернов проектирования приложений; Умение читать и понимать документацию, разрабатывать приложения на основании документации; Опыт разработки на Airflow, глубокое понимание принципов разработки DAG-ов; Опыт работы с брокерами сообщений: RabbitMQ, Kafka; Знание SQL и инфраструктуры Hadoop, понимание особенностей ее работы; Опыт работы с каким-либо дистрибутивом Hadoop (Cloudera, Arenadata, Hortonworks, Apache и т.п.); Опыт разработки приложений на Spark; Умение работать с системами контроля версий git; Опыт работы в ОС семейства UNIX: RHEL, Ubuntu; Общее понимание работы сетевых протоколов: TCP/IP, UDP, SSH, FTP, SMTP, IMAP Будет плюсом: Понимание особенностей экосистемы Hadoop; Понимание подходов к оптимизации производительности Python и Spark приложений; Опыт написания многопоточных приложений на Python. А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей эксклюзивный зарплатный проект для сотрудников в банке Вместе с нами ты сможешь решать интересные задачи, профессионально расти и развиваться, а также участвовать в кросс-командных проектах и определять собственную траекторию развития. "
    ],
    [
        "72feffa1-4e1b-3745-b540-f8dd04722854",
        null,
        " Февраль 2024г, профили в работе: B2B - опыт в финтехе 1)  две вакансии сюда немного разные по профилю ( ЛК - привлечение B2B партнёров и ВЭД ) __________________________________________________________________________ B2B - можно без финтех опыта 2) - лояльность (B2B) , есть еще одна позиция на эквайринг (интернет, не торговый) , но там пока описание не сделали еще (то есть здесь 2 позиции тоже) ____________________________________________________________________________ B2C - желателен опыт с маркетплейсами 3)  Подробнее про B2C (про нее не успели вчера) По требованиям +- тоже самое только очень важен опыт работы с маркетплейсами Продукт: Кредитование внутри маркетплейса (рассрочка) - кредитования физ лиц (покупателей маркетплейса) Задача: построить/проработать стратегию продукта (важен ретеншн и прирост новых клиентов на направление) Направление у нас новое Все члены команды важные для создания продукта +- уже есть или будут в ближ время, но сейчас самое главное - проработка стратегии Есть метрика бизнесовая, которую надо придумать как вырастить Продукт уже имеет неплохую долю внутри, продукт имеет неплохой ретеншн, продукт с достаточно большим количеством сценариев Ключевой портфель в кредитных продуктах Важно: чтобы был опыт развития продукта с нуля Чтобы человек был структурным, любил схемы, ясно излагал бы свои мысли Имел бы баланс между действиями и анализом Костюмер девелопмент, работа с макетами и тд Важна амбициозность ____________________________________________________________________   Банк для бизнеса — одно из ключевых направлений   Fintech. Мы разработали банк с нуля на собственной платформе, что дает максимальную гибкость, быструю скорость развития и независимость от сторонних вендоров. Банк глубоко интегрирован в маркетплейс, а команда отлично разбирается в торговле. Как результат — успешный запуск и стремительный рост клиентской базы, а в ближайшее время планируем вывести банк в топ по России. Как продавать:   - стартап внутри основной компании, имеющий поддержку крупной компании (3к человек, 500 в IT). Планы на ближайшие 1-1,5г. - вырасти х2 в It, глобально же за 2-3г. войти в топ-5 It-банков РФ, поэтому рост и развитие сейчас основная цель. "
    ],
    [
        "7de66249-ed0c-315d-8c52-3d9fd5082cc4",
        null,
        " все вакансии: Суперапп / Онбординг / Знакомства - сюда продолжаем также поиск, но все интервью сможем поставить только на 26-29дек или на январь (предупреждаем кандидатов) новая вакансия   и рекомендации !!! при общение с кандидатам в приоритете для нас закрытие вакансий в команду контента, онбординга и супераппа Локация: смотрим по РФ и РБ (есть офисы и удаленка). премии до 2-х окладов Готовы рассматривать и дороже, это примерный ориентир, дороже индивидуально будем далее согласовывать ЗП в резюме не указывать, только в сопроводе Как выбрать команду: Кандидат может указать от 1 до 3-х приоритетных команд, которые ему понравятся. Это можем указать в сопроводе. Скрининг: Важны ответы на приоритетные вопросы (в скрининге нам их отметят) Доп инфо: Карьерный рост в ближайший год точно не возможен, тк сейчас нужны именно разработчики. Возраст - ограничений как таковых нет, до 50 можно смотреть, но есть более молодые команды. Если оч взрослый более важно проверять все навыки. В супер ап можно до 50 лет, если хорошие софты, в Клипы более молодая комнада и молодой лид (смотрим максимум до 40 лучше). Хорошо, если спеуиалист из хорошего технического вуза. Стоп лист: Не хантим из яндекс, а также скинут полный стоп-лист Команды: Стек: Java (50%), Kotlin (50%), RxJava Ищем: Mid/Senior Команда: 13 специалистов, включая как Android-, так и iOS-разработчиков (внутри подразделяется на супер ап и мини ап) Важно: Смотрим часовой пояс - не более 2 часов разницы от мск Доп инфо: Код-ревью - есть Готовность работы с Java Интервью: 0 этап - наш, с hr, есть скрининг, в брифе подробно указывать причины перехода, опыт за последние 4 года расписать, готовность работы с Java указать 1 этап - кодинг + отвечают на вопросы разработчика (1,5ч) 2 этап - систем дизайн (кейсы, задачи) (до 2ч) 3 этап - финал с лидом и тех лидом - общение по опыту, знакомство, будут технические(!) вопросы по опыту (1ч) ( 1 ставка ) О проекте: Вертикальная лента видео, как внутри самого приложения  , так и отдельное приложение, есть также веб-версия. Стек: MVI, Kotlin (весь новый код), но также важно знание Java (на тех этапе может быть с ней задача) Ищем: Mid/Senior, от 2-3 лет и выше (мы от 3-х смотрим), лучше более опытного Команды: Команда авторов - 7 разработчиков + team Lead (отвечает за видео редактор и выкладку видео). Команда зрителей - 8 разработчиков + team Lead (отвечает за просмотр и потребление контента, отбор по интересам). Более молодая комнада и молодой лид (смотрим максимум до 40 лучше). Интервью: 0 этап - наш, с hr, есть скрининг, в брифе подробно указывать причины перехода, опыт за последние 4 года расписать, готовность работы с Java указать 1 этап - кодинг, алгоритмические задачи (2ч) 2 этап - систем дизайн (кейсы, задачи) (2ч) 3 этап - финал с лидом - сначала будет небольшая задача (!), которую можно решить за пол часа, далее общение по опыту, знакомство (1ч) Доп инфо: Жирный плюс будет - опыт работы с видео, со стримингом. Удержание и возврат пользователей -  ( 1 ставка ) О проекте: Работа с Push-уведомлениями. Команда активно взаимодействует с командой ML (Bid Data) и с Core-командой. Стек: Kotlin, RxJava Ищем: Уверенный Middle, самостоятельный (!) Команда: Появилась недавно. Планируется 1 iOS и 1 Android, есть backend-разработчик, QA, дизайнер. Доп инфо: Жирный плюс - Опыт со стримингом и видео. Онбординг - ( 2 ставки ) О проекте: Адаптация новых пользователей после регистрации в приложении, подбор интересного контента для них и т.д. Стек: Kotlin в основном (знание Java здесь будет как плюс, но не обязательное условие) Ищем: Mid+/Senior Интервью: скрининг с hr (наш), техничка, кодинг, финал Контент -  О проекте: истории, опросы, статьи, авторы и работа с ними (все, что связано с контентом) Важно: Смотрим часовой пояс - не более 2 часов разницы от мск Команда: 5 разработчиков, включая team lead'а Сообщества - направят ссылку попозже, пока не готова ( 1 ставка ) Команда: Кросс-функциональная команда - проджект менеджер, продукт менеджер, мобильные разработчики, веб-разработчики. Стек: Kotlin, RxJava Важно: Смотрим часовой пояс - не более 3 часов разницы от мск Хорошо прописать причину перехода в сопроводе(!) Знакомства - Лиза Воронова ( 1 ставка ) Задача проекта: Дейтинг Команда: Команда Знакомства входит в команду Суперапп, которая состоит из 15 ios- и android-разработчиков. Сама отдельно выделенная внутри команда Знакомств состоит из fullstack-разработчиков, к которой сейчас добавятся по одному ios и android разработчику, в дальнейшем также планируется расширение. Ищем: Senior   - Лиза Воронова ( 1 ставка ) О проекте: Настройки рекомендаций для пользователя в ленте, подбор наиболее интересного и релевантного контента. Ищем: Junior (от года коммерческого опыта), готовы рассматривать также Middle. Очень важны софты, команда яркая и динамичная, и сюда ищем разработчика, который также будет проактивным, открытым и стремящимся к развитию. Важно: В проекте не используется Jetpack Compose, он будет не скоро.  ( 1 ставка ) О проекте: Поиск — это про все вертикали: можно будет и в видео поделать задачи, и в музыке и в клипах и в людях, будет разнообразие Ищем: Middle+/Senior Задачи: Задачи разнообразные: и продуктовые фичи и техническое логирование для оценки качества поиска и оптимизации скорости отрисовки Команда: Небольшая, но очень дружная команда, в поректе присутствует легкий дух стартапа "
    ],
    [
        "2c530588-044c-3be6-967c-a921937007be",
        null,
        " 12-15 грейды   — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. Вместе мы создаем финтех, который будет доступен каждому: развиваем «Цифровую банковскую платформу», выстраиваем партнерские отношения с топовыми финансовыми компаниями, создаем комплексные решения для фронт- и бэк-офисов, строим системы работы с большими данными. В   стабильность работы — финансовая надежность, социальные гарантии, бонусы и бенефиты, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. Мы стремительно растем, масштабируемся и ищем новых специалистов в команду!   — современная быстроразвивающаяся компания с фокусом на высокие технологии. Мы выросли до 8 000 IT-специалистов менее чем за два года. Вместе мы создаем финтех, который будет доступен каждому: развиваем «Цифровую банковскую платформу», выстраиваем партнерские отношения с топовыми финансовыми компаниями, создаем комплексные решения для фронт- и бэк-офисов, строим системы работы с большими данными. В   стабильность работы — финансовая надежность, социальные гарантии, бонусы и бенефиты, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. Мы стремительно растем, масштабируемся и ищем новых специалистов в команду! Вместе с нами ты будешь: – выполнение функциональных обязанностей в рамках проекта по Миграции Платформ Данных (Arenadata Hadoop) – сбор, систематизация и проработка требований заказчиков – преобразование требований в функциональные и технические спецификации для дальнейшей передачи их в разработку – подготовка проектной документации (функциональные требования, технические задания и решения, спецификации, инструкции и т.д.), постановка задач на разработку – погласование документов с заинтересованными лицами – проверка требований на полноту и непротиворечивость – анализ требований для контроля их качества – обработка запросов на изменение требований к системе – организация, модерирование и протоколирование совещаний и мозговых штурмов – ведение реестра документации – ведение и актуализация спецификаций на сервисы/модели – изучение и анализ источников данных, анализ данных и взаимосвязей, возможностей их извлечения, обогащения и очистки – взаимодействие с командами Data science, конвейера Моделей ModelOps и тестирования – анализ данных и изучение бизнес-модели на тестовых и промышленных стендах с использованием инструментов Hue, Hive/Impala, Python – участие в процессах планирования работ, определения ресурсов и оценки трудозатрат, рисков проекта – участие в тестировании и в приемо-сдаточных испытаниях разработанного функционала – консультация пользователей сервисов, обучение, подготовка презентаций Какие знания и навыки для нас важны: – опыт анализа и описания источников банковских данных для загрузки в хранилище / озеро данных / построения отчетности от 2-х лет – опыт выявления требований Заказчиков; – опыт оценки реализуемости требований, их формализации и согласования с Заказчиками; – опыт контроля исполнения согласованных требований и презентации результатов Заказчикам – умение собирать, анализировать и систематизировать требования, сводить требования из различных источников – умение анализировать бизнес-процессы, структурировать и описывать требования по их автоматизации – опыт проектирования моделей и витрин данных и желательно знакомство с промышленными моделями финансовой предметной области – обязательное знание SQL на отличном уровне – опыт работы с промышленными СУБД (Oracle, PostgeSQL) – опыт разработки и согласования технической документации (ТЗ, ТР, протокол ПСИ), постановки задач на разработку – навыки планирования и оценки трудоемкости работ – опыт взаимодействия с командой разработки и тестирования – опыт работы c гибкими проектными методологиями (agile, scrum, kanban) – опыт проведения тестирования и приемо-сдаточных испытаний, разработки методики тестирования (формирование критериев приемки, тест-кейсов) – опыт работы с системами управления проектами/задачами (Jira/TFS/HP Service Manager и др.) – базовые знания по методам доставки данных в Hadoop – желательно знание экосистемы Hadoop (MapReduce, Spark streaming, Hbase, Spark SQL, Kafka, Hive, Impala, Hue и т.д.), их роль в экосистеме и выполняемые ими функции, технологии, на которых они базируются, методы взаимодействия с другими компонентами – знания инструментов BI/Data Visualizations & Discovery поверх Hadoop или файлового хранилища (S3, Ceph) – желательно знание методик проектирования ПО, – желательно знание нотаций моделирования (UML) А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удалённо или в гибридном формате; поддержка новичков по программе наставничества Buddy; ДМС с возможностью подключения близких родственников; сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь; корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого; насыщенная инножизнь: zoom-зарядки, лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое; скидки и купоны от сотен компаний-партнёров на единой платформе; маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях; дополнительные выходные и материальная поддержка в дни радостных (и не только) событий; дополнительный оплачиваемый отпуск (3 календарных дня); широкие возможности внутреннего и внешнего обучения; необходимая техника и софт для работы; конкурентная зарплата по итогам интервью, наличие премиальной составляющей. Вместе с нами ты сможешь решать интересные задачи, профессионально расти и развиваться, а также участвовать в кросс-командных проектах и определять собственную траекторию развития. Присоединяйся к команде  ! "
    ],
    [
        "f4a7096b-e1c4-3b4c-be6a-493eb29c6b0f",
        null,
        " обновление от 20.10 - смотрим 3 года вместо 4 Нужен Синьор Грейд до 15   — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. Вместе мы создаем финтех, который будет доступен каждому: развиваем «Цифровую банковскую платформу», выстраиваем партнерские отношения с топовыми финансовыми компаниями, создаем комплексные решения для фронт- и бэк-офисов, строим системы работы с большими данными. В   стабильность работы — финансовая надежность, социальные гарантии, бонусы и бенефиты, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. Мы стремительно растем, масштабируемся и ищем новых специалистов в команду! Стрим Регулярный бизнес Проект- Цифровой Рубль Создании лучшего приложения для операций в цифровых рублях для сегмента СМБ. Разработка системы с самого начала и участие в формировании клиентского пути на современном технологическом стеке. Кто мы? Прежде всего мы не только команда, но и единый дружный механизм, люди, абсолютно из разных городов (Екатеринбург, Оренбург, Гродно, Новосибирск, Санкт-Петербург, Москва, Воронеж, Ростов-на-Дону). Мы объединены единой целью - быть лучшей командой и конечно же хотим добиться успехов во всём! :) Что за продукт мы делаем? Наша задача: сделать максимально комфортной работу наших клиентов со специальными счетами. Это те самые интересные, порой непонятные счета, такие как: счета закупок (44-ФЗ), капремонт, счета нотариусов. Помимо того, что мы облегчаем работу клиентов, мы так же являемся теми, на кого могут положиться наши коллеги, принимающие на себя основной удар - менеджеры в офисах. Любая проблема с продуктом - это наша проблема в первую очередь, а не \"вон той команды/страны\". Вместе с нами ты будешь: Разрабатывать back-end части банковских сервисов в микросервисной архитектуре c использованием фреймворка Spring Boot; Участвовать в разработке и согласовании API; Участвовать в разработке архитектуры решения и выборе технологий, строить модели данных; Внедрять новых технологий и решение технических проблем; R&D ключевых участков подсистем. Какие знания и навыки для нас важны: Опыт BE разработки от 4-х лет; Готовность принимать решения и брать на себя ответственность; Стек Java, spring; Опыт проектирования и построения микросервисных архитектур; Опыт построения CI/CD; Опыт работы с платформой Kubernetes/OpenShift; Опыт работы с Message/Streaming-oriented middleware (Kafka/RabbitMQ). А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей эксклюзивный зарплатный проект для сотрудников в банке "
    ],
    [
        "47c1a3d8-84b7-3986-9214-f61679697e65",
        null,
        " Мы ищем профессионала для принятия участия в реализации амбициозного проекта по написанию новой АБС для нашего основного заказчика. В особенности проекта можно записать: реализация «с нуля», транзитивность архитектуры, высочайшие требования к производительности и отказоустойчивости решения, сжатые сроки. Вся реализация должна быть выполнена в рамках Омни-канальной платформы. Проект может стать прекрасным дополнением вашего портфолио. Работа будет проводиться в одном из стримов нашей большой команды. Сейчас предлагаем рассмотреть позицию на &lt;роль&gt; в стриме &lt;стрим&gt;. Чем предстоит заниматься: Организация работы scrum-команды (8-12 человек), постановка задач Разработка приложений с использованием микросервисной архитектуры Проектирование и разработка микросервисов и интеграционных сервисов/API Проектирование RESTfull API в соответствии с Best practice; Проведение code-review Работа в кросс-функциональной команде по гибким методологиям (scrum, двухнедельные спринты, релизы раз в 2 недели) Какие знания и навыки для нас важны: Опыт работы ИТ лидом / тех лидом разработки ПО от 2х лет Опыт работы разработчиком (в техническом стеке – React / JS / Java / Microservices / PostgreSQL Готовность принимать решения и брать на себя ответственность Опыт практической разработки микросервисов Опыт проектирования высоконагруженных систем Опыт работы c Agile-практиками или в Agile-командах, включая работу с инструментами Jira и Confluence Коммуникационные навыки, умение находить общий язык как с бизнес-заказчиками, так и с разработчиками и смежными подразделениями. "
    ],
    [
        "3c4359e8-8e2f-3c51-9b62-562080e1b549",
        null,
        " Мы ищем профессионала для принятия участия в реализации амбициозного проекта по написанию новой АБС для нашего основного заказчика. В особенности проекта можно записать: реализация «с нуля», транзитивность архитектуры, высочайшие требования к производительности и отказоустойчивости решения, сжатые сроки. Вся реализация должна быть выполнена в рамках Омни-канальной платформы. Проект может стать прекрасным дополнением вашего портфолио. Работа будет проводиться в одном из стримов нашей большой команды. Сейчас предлагаем рассмотреть позицию на &lt;роль&gt; в стриме &lt;стрим&gt;. Опыт работы с java от 3 лет Уверенные знания основных современных концепций и принципов разработки на платформе Java Хорошее знание и умение применять на практике принципы ООП, SOLID, DRY, KISS Знание стандартных алгоритмов и структур данных Опыт разработки на Java с использованием технологий: Spring Framework (Cloud, Boot, AOP, Security, etc), Hibernate Знание и опыт применения: Stream, Optional, Collections, etc. Разработка с использованием Java 8 - 11 Опыт работы с тестовыми фреймворками: Junit, TestNG, Mokito Опыт работы с реляционными базами данных Знание теоретических основ проектирования БД и построения эффективных запросов Опыт работы с Git, Maven. Плюсом будут Опыт проектирования высоконагруженных систем Опыт работы с Spring Boot, Spring Cloud Опыт работы с Docker, Kubernetes Опыт работы с TeamCity, Jira, Confluence Умение писать чистый, документированный и тестируемый код и тесты к нему (модульные и интеграционные) Понимание что такое микросервисная архитектура, её плюсы и минусы Как минимум знакомство с функциональной парадигмой разработки. "
    ],
    [
        "9c23bbc9-e2fe-39eb-ad49-3194275143ff",
        null,
        " Наш стэк: Java 11, PostgresSQ, Tarantool, Kafka/ ArtemisMQ, K8s Микро-сервисная архитектура Основные обязанности: Организация работы кросс функциональной ИТ-команды (7-12 человек), включая найм и мотивация сотрудников Организация и контроль разработки функционала, включая этапы сбора требований, разработки, тестирования и внедрения функционала Работа с backlog команды, приоритизация и аргументация необходимости реализации задач Участие в разработке и согласовании проектной документации (концепций, технических заданий, спецификаций) Работа по методологии scrum, организация мероприятий команды и ее артефактов, контроль задач (артефакты и задачи ведутся в Сфера – аналог Confluence и Jira) От вас потребуется: Понимание брокерского бизнеса Опыт управления командой Участие в проектах по переходу на микро-сервисную архитектуру от монолитных систем Понимание работы с очередями (Kafka, ArtemisMQ) Понимание предназначения сред кластеризации и виртуализации (K8s/OpenShift, Openstack, Nutanix) Опыт работы с Agile-практиками, включая работу с инструментами Jira и Confluence "
    ],
    [
        "b2315867-73a2-3d43-acac-cbb92bd793b3",
        null,
        " До 15 грейда Назначение стрима: Разработка новых продуктов брокерского обслуживания, реализация торговых омниканальных сервисов. Команды стрима реализуют несколько омниканальных систем, связанных с торговыми операциями и первичным размещением ценных бумаг, инвестиционными событиями. Сами системы состоят как из backend сервисов (написанных в парадигме микросервистной архитектуры), так и микрофронтенда, встраимового в web и мобильные каналы банка. ТРЕБОВАНИЯ: - Опыт коммерческой разработки Highload приложений на Java; - Отличные знания Java Core и опыт работы со стеком Spring, в том числе SpringBoot; - Использовали Git; Gradle/Maven; - Опыт в построении микросервисной архитектуры; - Навыки работы с очередями (Kafka, RabbitMQ, ArtemisMQ); - Навыки работы с (Docker, K8s/OpenShift); - Опыт работы с СУБД (PostgreSQL, Oracle); - Опыт написания unit - тестов; - Понимание Reactive Spring (Spring WebFlux, R2DBC, Reactive Spring Data). БУДЕТ ПЛЮСОМ, ЕСЛИ: - Есть опыт в построении высоконагруженных распределенных систем и понимание проблем многопоточной обработки данных; - Есть понимание основ криптографии и практический опыт в использовании TLS; - Есть опыт работы c Nexus. "
    ],
    [
        "f97f9ccf-12cc-377a-8e1d-37039d591c8b",
        null,
        " Мы ждём: - python3 - asyncio - pytest - опыт работы с асинхронными http-фреймворками (aiohttp / fastapi / sanic / litestar / etc.) в качестве основного инструмента 2+ лет - опыт работы с postgresql или другими реляционными базами данных - SQL - Docker Будет плюсом: - опыт работы с очередями (rabbitmq / kafka / Nats Messaging / etc.) - redis - gitlab-ci - ELK - grafana - опыт проектирования микросервисов, API - k8s "
    ],
    [
        "aecfdaf6-e12c-3309-8f1b-157028ef63d5",
        null,
        " Опыт работы с java от 3 лет Уверенные знания основных современных концепций и принципов разработки на платформе Java Хорошее знание и умение применять на практике принципы ООП, SOLID, DRY, KISS Знание стандартных алгоритмов и структур данных Опыт разработки на Java с использованием технологий: Spring Framework (Cloud, Boot, AOP, Security, etc), Hibernate Знание и опыт применения: Stream, Optional, Collections, etc. Разработка с использованием Java 8 - 11 Опыт работы с тестовыми фреймворками: Junit, TestNG, Mokito Опыт работы с реляционными базами данных Знание теоретических основ проектирования БД и построения эффективных запросов Опыт работы с Git, Maven. Плюсом будут Опыт проектирования высоконагруженных систем Опыт работы с Spring Boot, Spring Cloud Опыт работы с Docker, Kubernetes Опыт работы с TeamCity, Jira, Confluence Умение писать чистый, документированный и тестируемый код и тесты к нему (модульные и интеграционные) Понимание что такое микросервисная архитектура, её плюсы и минусы Как минимум знакомство с функциональной парадигмой разработки. "
    ],
    [
        "a5d0e1fd-7baa-3a6f-98f4-b908ac7fce43",
        null,
        " Только Senior до 15 грейда Проект «Трансформация брокерских систем» входит в состав программы «Импортозамещение» Основные направления: -Внутренний учет брокерских операций – загрузка и хранение данных о сделках и неторговых операциях клиентов. Урегулирование задолженности клиентов в рамках закрытия дня. Выгрузка данных об итогах торговой сессии в системы бухгалтерского и депозитарного учета. Проведение сверок остатков ДС и ЦБ на счетах внутреннего учета. -Регуляторная отчетность – ведение регистров ВУ, формирование регулярной отчетности в ЦБ и ФНС. -Налоговый учет – расчет, учет и удержание налогов в части брокерского обслуживания. Выгрузка информации о налогооблагаемой базе клиентов в системы Банка. Какие знания и навыки для нас важны: Опыт BE разработки от 4-х лет; Готовность принимать решения и брать на себя ответственность; Стек Java, spring; Опыт проектирования и построения микросервисных архитектур; Опыт построения CI/CD; Опыт работы с платформой Kubernetes/OpenShift; Опыт работы с Message/Streaming-oriented middleware (Kafka/RabbitMQ). А мы создадим комфортные условия для работы: гибкий график работы — в офисе, удаленно или в гибридном формате поддержка новичков по программе наставничества Buddy ДМС с возможностью подключения близких родственников сервис психологической поддержки, ведь нам очень важно, как ты себя чувствуешь корпоративный кафетерий льгот с возможностью компенсации билетов и отелей в отпуске, абонементов в спортзал, спортинвентаря, билетов в театр и многого другого насыщенная инножизнь: лекции и мастер-классы от известных спикеров, тимбилдинги, корпоративная библиотека и многое другое скидки и купоны от сотен компаний-партнёров на единой платформе маркетплейс мерча с собственной корпоративной валютой, которая начисляется за участие в активностях дополнительные выходные в дни радостных (и не только) событий дополнительный оплачиваемый отпуск (3 календарных дня) широкие возможности внутреннего и внешнего обучения необходимая техника и софт для работы конкурентная зарплата по итогам интервью, наличие премиальной составляющей эксклюзивный зарплатный проект для сотрудников в банке "
    ],
    [
        "259bf318-e6a7-3b6c-93f9-e1804a89ee63",
        null,
        " -бренд одежды и аксессуаров, созданный в 2008 году. Наши магазины представлены в России и СНГ, а также онлайн с доставкой по всему миру. Наш успех заключается в слаженной командной работе, что позволяет бренду создавать востребованный качественный продукт. Мы всегда рады знакомству с новыми людьми, которые разделяют наши ценности и позитивный настрой. ВАМ ПРЕДСТОИТ: Проектирование, разработка и поддержка высокопроизводительных и масштабируемых веб-приложений. Оптимизация существующего кода для повышения производительности и улучшения пользовательского опыта. Реализация современных паттернов и лучших практик разработки веб-приложений. Участие в анализе функциональных требований и консультации по технической реализации интерфейсов. Взаимодействие с командой продукта для понимания потребностей пользователей и перевода их в технические решения. Активное изучение новых технологий и инструментов, применение их в разработке. Взаимодействие с дизайнерами для обеспечения соответствия дизайна и интерактивности. Сотрудничество с бэкэнд-разработчиками для создания эффективных и надежных веб-приложений. Отладка и решение проблем взаимодействия интерфейса с бэкэнд-частью приложения. Постоянное следование трендам в области веб-технологий и предложение современных подходов. Участие в планировании проектов, оценка трудозатрат и предоставление технических решений. Внедрение мер безопасности в интерфейсах и обеспечение безопасной передачи данных. Оптимизация загрузки страниц и ресурсов для улучшения производительности. МЫ ОЖИДАЕМ: Опыт коммерческой разработки на Vue.js, Nuxt.js, Vuex/Pinia; Уверенное знание HTML5, CSS, SCSS/Less; Уверенные знания JavaScript, TypeScript(будет +) Опыт работы с webpack, vite; Кроссбраузерная адаптивная верстка; Понимание принципов разработки web-приложения на REST API, Postman, Swagger; Опыт работы с Git, GitLab CI, Docker (Docker Compose); Умение разбираться в чужом коде; Умение оценивать задачи и выдерживать сроки; Коммуникация и кроссфункциональное взаимодействие, ответственность, работа в команде, способность к обучению и развитию, адаптивность, настойчивость, упорство. МЫ ПРЕДЛАГАЕМ: Развитие под чутким руководством руководителя отдела, передача опыта, обучение; Возможность карьерного роста; Работа в самой эффективной Fashion кампании в   Директ по данным  а; Оформление согласно ТК РФ; График работы: дистанционный 5/2 (9-18/10-19); Заботу о твоем здоровье (ДМС со стоматологией); Корпоративный английский; Корпоративное обучение; Скидки на продукцию бренда; Дружный коллектив, открытую корпоративную культуру. ! ------------------------------------------------- Цель должности: Осуществление высококачественной разработки и оптимизации пользовательских интерфейсов веб-приложений, активное участие в процессе создания программного продукта. Небольшая информация про команду и проект: Команда ekom it, 20 человек. это направление бекэнд, фронтенд iOS, Android , 1С, QA support и т.д. Планы на 24 год это усиление и расширение, плюс 30 человек. Есть очень большие изменения с точки зрения команды. Если говорить о команде именно фронт. Сейчас у нас один разработчик. Вот это сейчас вообще самая слабое звено в нашей команде. А план на 24 год, 5-6 человек ( фронд). Про культуру процессы, мы строим классические, командные схемы работы в жире и работаем по скраму. "
    ]
]